//
//  AdapteTargetObject.h
//  testSingature
//
//  Created by jabraknight on 2021/12/31.
//  Copyright © 2021 zk. All rights reserved.
//
/*
 * 适配器说明
 　Adapter定义：将一个类的接口转换成客户希望的另外一个接口，使得原本由于接口不兼容而不能一起工作的那些类能一起工作。

 类结构型模式:适配器与适配者之间是继承（或实现）关系；类之间的耦合度高，要求程序员了解现有组件库中的相关组件的内部结构;
 对象结构型模式:适配器与适配者之间是关联关系；类之间的耦合度低;

 将目标类和适配者类解耦，通过引入一个适配器类来重用现有的适配者类，无须修改原有结构。
 增加了类的透明性和复用性，将具体的业务实现过程封装在适配者类中，对于客户端类而言是透明的，而且提高了适配者的复用性，同一个适配者类可以在多个不同的系统中复用。
 灵活性和扩展性都非常好，通过使用配置文件，可以很方便地更换适配器，也可以在不修改原有代码的基础上增加新的适配器类，完全符合“开闭原则”。

 适配器模式优缺点
 　　主要优点：

 将目标类和适配者类解耦，通过引入一个适配器类来重用现有的适配者类，无须修改原有结构。
 增加了类的透明性和复用性，将具体的业务实现过程封装在适配者类中，对于客户端类而言是透明的，而且提高了适配者的复用性，同一个适配者类可以在多个不同的系统中复用。
 灵活性和扩展性都非常好，通过使用配置文件，可以很方便地更换适配器，也可以在不修改原有代码的基础上增加新的适配器类，完全符合“开闭原则”。
 　　具体来说，类适配器模式还有如下优点：

 由于适配器类是适配者类的子类，因此可以在适配器类中置换一些适配者的方法，使得适配器的灵活性更强。
 　　对象适配器模式还有如下优点：

 一个对象适配器可以把多个不同的适配者适配到同一个目标；
 可以适配一个适配者的子类，由于适配器和适配者之间是关联关系，根据“里氏代换原则”，适配者的子类也可通过该适配器进行适配。
 　　类适配器模式的缺点如下：

 对于Java、C#等不支持多重类继承的语言，一次最多只能适配一个适配者类，不能同时适配多个适配者；
 适配者类不能为最终类，如在Java中不能为final类，C#中不能为sealed类；
 在Java、C#等语言中，类适配器模式中的目标抽象类只能为接口，不能为类，其使用有一定的局限性。
 　　对象适配器模式的缺点如下：

 与类适配器模式相比，要在适配器中置换适配者类的某些方法比较麻烦。如果一定要置换掉适配者类的一个或多个方法，可以先做一个适配者类的子类，将适配者类的方法置换掉，然后再把适配者类的子类当做真正的适配者进行适配，实现过程较为复杂。
 适配器模式实现
 类适配器模式可采用定义一个适配器类来实现当前系统的业务接口，同时又继承现有组件库中已经存在的组件。
 对象适配器模式可釆用将现有组件库中已经实现的组件引入适配器类中，该类同时实现当前系统的业务接口。现在来介绍它们的基本结构。
 　　适配器模式（Adapter）包含以下主要角色。

 目标（Target）接口：当前系统业务所期待的接口，它可以是抽象类或接口。
 适配者（Adaptee）类：它是被访问和适配的现存组件库中的组件接口。
 适配器（Adapter）类：它是一个转换器，通过继承或引用适配者的对象，把适配者接口转换成目标接口，让客户按目标接口的格式访问适配者。
 适配器模式适用场景
 　　常见适配器模式使用场景如下：

 系统需要使用一些现有的类，而这些类的接口（如方法名）不符合系统的需要，甚至没有这些类的源代码。
 想创建一个可以重复使用的类，用于与一些彼此之间没有太大关联的一些类，包括一些可能在将来引进的类一起工作。
 */
#import <Foundation/Foundation.h>
// 客户期望的接口 //目标接口
@protocol TargetDelgate <NSObject>

- (void)request;

@end
